{
    "token_to_id": {
        "<": 1,
        "?": 2,
        "x": 3,
        "m": 4,
        "l": 5,
        " ": 6,
        "version=": 7,
        "\"": 8,
        "1": 9,
        ".": 10,
        "0": 11,
        ">": 12,
        "<svg": 13,
        "xmlns=": 14,
        "h": 15,
        "t": 16,
        "p": 17,
        ":": 18,
        "/": 19,
        "w": 20,
        "3": 21,
        "o": 22,
        "r": 23,
        "g": 24,
        "2": 25,
        "s": 26,
        "v": 27,
        "xmlns:xlink=": 28,
        "9": 29,
        "i": 30,
        "n": 31,
        "k": 32,
        "height=": 33,
        "8": 34,
        "7": 35,
        "width=": 36,
        "6": 37,
        "5": 38,
        "viewBox=": 39,
        "<defs": 40,
        "<g": 41,
        "transform=": 42,
        "matrix": 43,
        "(": 44,
        ",": 45,
        ")": 46,
        "fill=\"#ffffff\"": 47,
        "stroke=\"#ffffff\"": 48,
        "style=": 49,
        "fill-opacity: 1;": 50,
        "stroke-opacity: 1;": 51,
        "stroke-width: 0.2;": 52,
        "<polygon": 53,
        "points=": 54,
        "4": 55,
        "d": 56,
        "a": 57,
        "y": 58,
        "none": 59,
        ";": 60,
        "fill=\"#000000\"": 61,
        "stroke=\"none\"": 62,
        "pointer-events: visible;": 63,
        "-": 64,
        "</g>": 65,
        "block": 66,
        "<text": 67,
        "x=": 68,
        "y=": 69,
        "em": 70,
        "f": 71,
        "V": 72,
        "e": 73,
        "z": 74,
        "px": 75,
        "c": 76,
        "u": 77,
        "default": 78,
        "U": 79,
        "N": 80,
        "D": 81,
        "E": 82,
        "F": 83,
        "I": 84,
        "</text>": 85,
        "'": 86,
        "A": 87,
        "R": 88,
        "K": 89,
        "P": 90,
        "H": 91,
        "M": 92,
        "T": 93,
        "O": 94,
        "stroke=\"#000000\"": 95,
        "S": 96,
        "L": 97,
        "stroke-width: 1;": 98,
        "fill=\"none\"": 99,
        "<path": 100,
        "d=": 101,
        "q": 102,
        "Z": 103,
        "fill=\"#f0f0ff\"": 104,
        "<line": 105,
        "x1=": 106,
        "x2=": 107,
        "y1=": 108,
        "y2=": 109,
        "fill=\"rgb(255, 255, 255)\"": 110,
        "stroke=\"rgb(0, 0, 0)\"": 111,
        "stroke=\"rgb(154, 154, 154)\"": 112,
        "stroke-dasharray=": 113,
        "fill-opacity=": 114,
        "fill=\"#444444\"": 115,
        "translate": 116,
        "font-size=": 117,
        "font-family=": 118,
        "C": 119,
        "W": 120,
        "stroke-width=": 121,
        "B": 122,
        "_": 123,
        "G": 124,
        "<polyline": 125,
        "stroke-linejoin=": 126,
        "<rect": 127,
        "<circle": 128,
        "cx=": 129,
        "cy=": 130,
        "r=": 131,
        "fill-opacity: 0.7;": 132,
        "stroke-width: 1.8;": 133,
        "fill=\"#0000ff\"": 134,
        "stroke=\"#0000ff\"": 135,
        "fill-opacity: 0.5;": 136,
        "crosshair": 137,
        "fill-opacity: 0.5\"/": 138,
        "fill-opacity: 0.1\" ": 139,
        "fill-opacity: 0.1\"/": 140,
        "fill-opacity: 0.1;": 141,
        "</svg>": 142,
        "stroke=\"#9a9a9a\"": 143,
        "stroke-width: 1.5;": 144,
        "stroke=\"#4c4c4c\"": 145,
        "&": 146,
        "<ellipse": 147,
        "rx=": 148,
        "ry=": 149,
        "stroke=\"#d3d3d3\"": 150,
        "pointer-events: none;": 151,
        "<marker": 152,
        "markerWidth=": 153,
        "markerHeight=": 154,
        "orient=": 155,
        "refX=": 156,
        "refY=": 157,
        "fill=\"#d3d3d3\"": 158,
        "</marker>": 159,
        "</defs>": 160,
        "#": 161,
        "<use": 162,
        "xlink:href=": 163,
        "Y": 164,
        "stroke=\"rgb(76, 76, 76)\"": 165,
        "J": 166,
        "stroke=\"#fc0fc0\"": 167,
        "fill-opacity: 0.4;": 168,
        "stroke-opacity: 0.9;": 169,
        "stroke-opacity: 0.4;": 170,
        "fill=\"#fff\"": 171,
        "stroke=\"#000\"": 172,
        "Q": 173,
        "+": 174,
        " />": 175,
        "\\": 176,
        "fill=\"rgb(0, 0, 0)\"": 177,
        "encoding=": 178,
        "\n": 179,
        "fill-opacity: 0.5\" ": 180
    },
    "id_to_token": {
        "1": "<",
        "2": "?",
        "3": "x",
        "4": "m",
        "5": "l",
        "6": " ",
        "7": "version=",
        "8": "\"",
        "9": "1",
        "10": ".",
        "11": "0",
        "12": ">",
        "13": "<svg",
        "14": "xmlns=",
        "15": "h",
        "16": "t",
        "17": "p",
        "18": ":",
        "19": "/",
        "20": "w",
        "21": "3",
        "22": "o",
        "23": "r",
        "24": "g",
        "25": "2",
        "26": "s",
        "27": "v",
        "28": "xmlns:xlink=",
        "29": "9",
        "30": "i",
        "31": "n",
        "32": "k",
        "33": "height=",
        "34": "8",
        "35": "7",
        "36": "width=",
        "37": "6",
        "38": "5",
        "39": "viewBox=",
        "40": "<defs",
        "41": "<g",
        "42": "transform=",
        "43": "matrix",
        "44": "(",
        "45": ",",
        "46": ")",
        "47": "fill=\"#ffffff\"",
        "48": "stroke=\"#ffffff\"",
        "49": "style=",
        "50": "fill-opacity: 1;",
        "51": "stroke-opacity: 1;",
        "52": "stroke-width: 0.2;",
        "53": "<polygon",
        "54": "points=",
        "55": "4",
        "56": "d",
        "57": "a",
        "58": "y",
        "59": "none",
        "60": ";",
        "61": "fill=\"#000000\"",
        "62": "stroke=\"none\"",
        "63": "pointer-events: visible;",
        "64": "-",
        "65": "</g>",
        "66": "block",
        "67": "<text",
        "68": "x=",
        "69": "y=",
        "70": "em",
        "71": "f",
        "72": "V",
        "73": "e",
        "74": "z",
        "75": "px",
        "76": "c",
        "77": "u",
        "78": "default",
        "79": "U",
        "80": "N",
        "81": "D",
        "82": "E",
        "83": "F",
        "84": "I",
        "85": "</text>",
        "86": "'",
        "87": "A",
        "88": "R",
        "89": "K",
        "90": "P",
        "91": "H",
        "92": "M",
        "93": "T",
        "94": "O",
        "95": "stroke=\"#000000\"",
        "96": "S",
        "97": "L",
        "98": "stroke-width: 1;",
        "99": "fill=\"none\"",
        "100": "<path",
        "101": "d=",
        "102": "q",
        "103": "Z",
        "104": "fill=\"#f0f0ff\"",
        "105": "<line",
        "106": "x1=",
        "107": "x2=",
        "108": "y1=",
        "109": "y2=",
        "110": "fill=\"rgb(255, 255, 255)\"",
        "111": "stroke=\"rgb(0, 0, 0)\"",
        "112": "stroke=\"rgb(154, 154, 154)\"",
        "113": "stroke-dasharray=",
        "114": "fill-opacity=",
        "115": "fill=\"#444444\"",
        "116": "translate",
        "117": "font-size=",
        "118": "font-family=",
        "119": "C",
        "120": "W",
        "121": "stroke-width=",
        "122": "B",
        "123": "_",
        "124": "G",
        "125": "<polyline",
        "126": "stroke-linejoin=",
        "127": "<rect",
        "128": "<circle",
        "129": "cx=",
        "130": "cy=",
        "131": "r=",
        "132": "fill-opacity: 0.7;",
        "133": "stroke-width: 1.8;",
        "134": "fill=\"#0000ff\"",
        "135": "stroke=\"#0000ff\"",
        "136": "fill-opacity: 0.5;",
        "137": "crosshair",
        "138": "fill-opacity: 0.5\"/",
        "139": "fill-opacity: 0.1\" ",
        "140": "fill-opacity: 0.1\"/",
        "141": "fill-opacity: 0.1;",
        "142": "</svg>",
        "143": "stroke=\"#9a9a9a\"",
        "144": "stroke-width: 1.5;",
        "145": "stroke=\"#4c4c4c\"",
        "146": "&",
        "147": "<ellipse",
        "148": "rx=",
        "149": "ry=",
        "150": "stroke=\"#d3d3d3\"",
        "151": "pointer-events: none;",
        "152": "<marker",
        "153": "markerWidth=",
        "154": "markerHeight=",
        "155": "orient=",
        "156": "refX=",
        "157": "refY=",
        "158": "fill=\"#d3d3d3\"",
        "159": "</marker>",
        "160": "</defs>",
        "161": "#",
        "162": "<use",
        "163": "xlink:href=",
        "164": "Y",
        "165": "stroke=\"rgb(76, 76, 76)\"",
        "166": "J",
        "167": "stroke=\"#fc0fc0\"",
        "168": "fill-opacity: 0.4;",
        "169": "stroke-opacity: 0.9;",
        "170": "stroke-opacity: 0.4;",
        "171": "fill=\"#fff\"",
        "172": "stroke=\"#000\"",
        "173": "Q",
        "174": "+",
        "175": " />",
        "176": "\\",
        "177": "fill=\"rgb(0, 0, 0)\"",
        "178": "encoding=",
        "179": "\n",
        "180": "fill-opacity: 0.5\" "
    },
    "ctr": 182,
    "end_token": 181,
    "max_seq_len": 339345
}