{
    "token_to_id": {
        "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<svg style=\"background-color: #000;\" version=\"1.1\" viewBox=\"0 0 100.0 100.0\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:inkscape=\"http://www.inkscape.org/namespaces/inkscape\">": 1,
        "\n": 2,
        " ": 3,
        "<g": 4,
        "id=": 5,
        "\"": 6,
        "layer": 7,
        "A": 8,
        "D": 9,
        "-": 10,
        "N": 11,
        "O": 12,
        "T": 13,
        "E": 14,
        "B": 15,
        "L": 16,
        "P": 17,
        "inkscape:groupmode=": 18,
        "inkscape:label=": 19,
        ">": 20,
        "<circle": 21,
        "cx=": 22,
        "4": 23,
        ".": 24,
        "8": 25,
        "7": 26,
        "9": 27,
        "2": 28,
        "5": 29,
        "0": 30,
        "6": 31,
        "cy=": 32,
        "1": 33,
        "fill=": 34,
        "none": 35,
        "r=": 36,
        "3": 37,
        "stroke=": 38,
        "rgb": 39,
        "(": 40,
        ",": 41,
        ")": 42,
        "stroke-width=": 43,
        "/": 44,
        "</g>": 45,
        "Q": 46,
        "M": 47,
        "<path": 48,
        "d=": 49,
        "instance-id=": 50,
        "semantic-id=": 51,
        "<ellipse": 52,
        "rx=": 53,
        "ry=": 54,
        "transform=": 55,
        "rotate": 56,
        "F": 57,
        "R": 58,
        "H": 59,
        "I": 60,
        "C": 61,
        "U": 62,
        "_": 63,
        "<text": 64,
        "font-family=\"Noto": 65,
        "S": 66,
        "a": 67,
        "n": 68,
        "s": 69,
        "J": 70,
        "K": 71,
        "font-size=": 72,
        "x=": 73,
        "y=": 74,
        "Y": 75,
        "</text>": 76,
        "m": 77,
        "W": 78,
        "X": 79,
        "d": 80,
        "o": 81,
        "t": 82,
        "e": 83,
        "w": 84,
        "l": 85,
        "i": 86,
        "</svg>": 87,
        "V": 88,
        "f": 89,
        "p": 90,
        "'": 91,
        "%": 92,
        "+": 93,
        "$": 94,
        "G": 95,
        "Z": 96,
        "c": 97,
        "k": 98,
        "h": 99,
        "r": 100,
        "b": 101,
        "#": 102,
        "300X7=": 103,
        "i=": 104,
        "u": 105,
        "q": 106,
        "*": 107,
        "j": 108,
        "x": 109,
        "\\": 110,
        "!": 111,
        "<": 112,
        "?": 113,
        "version=": 114,
        "encoding=": 115,
        "<svg": 116,
        "style=": 117,
        "g": 118,
        ":": 119,
        ";": 120,
        "viewBox=": 121,
        "xmlns=": 122,
        "v": 123,
        "xmlns:inkscape=": 124,
        "z": 125,
        "y": 126,
        "~": 127,
        "L=": 128,
        "@": 129,
        "300x11=": 130,
        "5=": 131,
        "H=": 132,
        "BXH=": 133,
        "[": 134,
        "]": 135,
        "=": 136,
        "h=": 137,
        "S=": 138,
        "HqHq=": 139,
        "R2=": 140,
        "R1=": 141,
        "11x250=": 142,
        "s=": 143,
        "300X10=": 144,
        "D=": 145,
        "300X2=": 146,
        "62=": 147,
        "block": 148,
        "260x3=": 149,
        "\u007f": 150,
        "100=": 151,
        "9=": 152,
        "6=": 153,
        "260X6=": 154,
        "300x7=": 155,
        "280X7=": 156,
        "B=": 157,
        "260X9=": 158,
        "280X10=": 159,
        "1=": 160,
        "260x4=": 161,
        "W=": 162,
        "R5=": 163,
        "R4=": 164,
        "I=": 165,
        "300x9=": 166,
        "300X5=": 167,
        "G=": 168,
        "|": 169,
        "R3=": 170,
        "250X2=": 171,
        "300x15=": 172,
        "260x8=": 173,
        "26=": 174,
        "260X5=": 175,
        "250X5=": 176,
        "260x11=": 177,
        "14X270=": 178,
        "260X7=": 179,
        "300X9=": 180,
        "62X6=": 181,
        "250X8=": 182,
        "8x260=": 183,
        "300x8=": 184,
        "260X8=": 185,
        "260x12=": 186,
        "300X8=": 187,
        "5x2=": 188,
        "X=": 189,
        "Y=": 190,
        "270X8=": 191,
        "7=": 192,
        "31=": 193,
        "40=": 194,
        "300X11=": 195,
        "^": 196,
        "81X2=": 197,
        "300x5=": 198
    },
    "id_to_token": {
        "1": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<svg style=\"background-color: #000;\" version=\"1.1\" viewBox=\"0 0 100.0 100.0\" xmlns=\"http://www.w3.org/2000/svg\" xmlns:inkscape=\"http://www.inkscape.org/namespaces/inkscape\">",
        "2": "\n",
        "3": " ",
        "4": "<g",
        "5": "id=",
        "6": "\"",
        "7": "layer",
        "8": "A",
        "9": "D",
        "10": "-",
        "11": "N",
        "12": "O",
        "13": "T",
        "14": "E",
        "15": "B",
        "16": "L",
        "17": "P",
        "18": "inkscape:groupmode=",
        "19": "inkscape:label=",
        "20": ">",
        "21": "<circle",
        "22": "cx=",
        "23": "4",
        "24": ".",
        "25": "8",
        "26": "7",
        "27": "9",
        "28": "2",
        "29": "5",
        "30": "0",
        "31": "6",
        "32": "cy=",
        "33": "1",
        "34": "fill=",
        "35": "none",
        "36": "r=",
        "37": "3",
        "38": "stroke=",
        "39": "rgb",
        "40": "(",
        "41": ",",
        "42": ")",
        "43": "stroke-width=",
        "44": "/",
        "45": "</g>",
        "46": "Q",
        "47": "M",
        "48": "<path",
        "49": "d=",
        "50": "instance-id=",
        "51": "semantic-id=",
        "52": "<ellipse",
        "53": "rx=",
        "54": "ry=",
        "55": "transform=",
        "56": "rotate",
        "57": "F",
        "58": "R",
        "59": "H",
        "60": "I",
        "61": "C",
        "62": "U",
        "63": "_",
        "64": "<text",
        "65": "font-family=\"Noto",
        "66": "S",
        "67": "a",
        "68": "n",
        "69": "s",
        "70": "J",
        "71": "K",
        "72": "font-size=",
        "73": "x=",
        "74": "y=",
        "75": "Y",
        "76": "</text>",
        "77": "m",
        "78": "W",
        "79": "X",
        "80": "d",
        "81": "o",
        "82": "t",
        "83": "e",
        "84": "w",
        "85": "l",
        "86": "i",
        "87": "</svg>",
        "88": "V",
        "89": "f",
        "90": "p",
        "91": "'",
        "92": "%",
        "93": "+",
        "94": "$",
        "95": "G",
        "96": "Z",
        "97": "c",
        "98": "k",
        "99": "h",
        "100": "r",
        "101": "b",
        "102": "#",
        "103": "300X7=",
        "104": "i=",
        "105": "u",
        "106": "q",
        "107": "*",
        "108": "j",
        "109": "x",
        "110": "\\",
        "111": "!",
        "112": "<",
        "113": "?",
        "114": "version=",
        "115": "encoding=",
        "116": "<svg",
        "117": "style=",
        "118": "g",
        "119": ":",
        "120": ";",
        "121": "viewBox=",
        "122": "xmlns=",
        "123": "v",
        "124": "xmlns:inkscape=",
        "125": "z",
        "126": "y",
        "127": "~",
        "128": "L=",
        "129": "@",
        "130": "300x11=",
        "131": "5=",
        "132": "H=",
        "133": "BXH=",
        "134": "[",
        "135": "]",
        "136": "=",
        "137": "h=",
        "138": "S=",
        "139": "HqHq=",
        "140": "R2=",
        "141": "R1=",
        "142": "11x250=",
        "143": "s=",
        "144": "300X10=",
        "145": "D=",
        "146": "300X2=",
        "147": "62=",
        "148": "block",
        "149": "260x3=",
        "150": "\u007f",
        "151": "100=",
        "152": "9=",
        "153": "6=",
        "154": "260X6=",
        "155": "300x7=",
        "156": "280X7=",
        "157": "B=",
        "158": "260X9=",
        "159": "280X10=",
        "160": "1=",
        "161": "260x4=",
        "162": "W=",
        "163": "R5=",
        "164": "R4=",
        "165": "I=",
        "166": "300x9=",
        "167": "300X5=",
        "168": "G=",
        "169": "|",
        "170": "R3=",
        "171": "250X2=",
        "172": "300x15=",
        "173": "260x8=",
        "174": "26=",
        "175": "260X5=",
        "176": "250X5=",
        "177": "260x11=",
        "178": "14X270=",
        "179": "260X7=",
        "180": "300X9=",
        "181": "62X6=",
        "182": "250X8=",
        "183": "8x260=",
        "184": "300x8=",
        "185": "260X8=",
        "186": "260x12=",
        "187": "300X8=",
        "188": "5x2=",
        "189": "X=",
        "190": "Y=",
        "191": "270X8=",
        "192": "7=",
        "193": "31=",
        "194": "40=",
        "195": "300X11=",
        "196": "^",
        "197": "81X2=",
        "198": "300x5="
    },
    "ctr": 200,
    "end_token": 199,
    "max_seq_len": 9994
}