{
    "token_to_id": {
        "<": 1,
        "?": 2,
        "x": 3,
        "m": 4,
        "l": 5,
        " ": 6,
        "version=": 7,
        "\"": 8,
        "1": 9,
        ".": 10,
        "0": 11,
        "encoding=": 12,
        "u": 13,
        "t": 14,
        "f": 15,
        "-": 16,
        "8": 17,
        ">": 18,
        "\n": 19,
        "<svg": 20,
        "style=": 21,
        "b": 22,
        "a": 23,
        "c": 24,
        "k": 25,
        "g": 26,
        "r": 27,
        "o": 28,
        "n": 29,
        "d": 30,
        ":": 31,
        "#": 32,
        ";": 33,
        "viewBox=": 34,
        "xmlns=": 35,
        "h": 36,
        "p": 37,
        "/": 38,
        "w": 39,
        "3": 40,
        "2": 41,
        "s": 42,
        "v": 43,
        "xmlns:inkscape=": 44,
        "i": 45,
        "e": 46,
        "<g": 47,
        "id=": 48,
        "layer": 49,
        "A": 50,
        "D": 51,
        "N": 52,
        "O": 53,
        "T": 54,
        "E": 55,
        "B": 56,
        "L": 57,
        "P": 58,
        "inkscape:groupmode=": 59,
        "inkscape:label=": 60,
        "<circle": 61,
        "cx=": 62,
        "4": 63,
        "7": 64,
        "9": 65,
        "5": 66,
        "6": 67,
        "cy=": 68,
        "fill=": 69,
        "none": 70,
        "r=": 71,
        "stroke=": 72,
        "rgb": 73,
        "(": 74,
        ",": 75,
        ")": 76,
        "stroke-width=": 77,
        "</g>": 78,
        "Q": 79,
        "M": 80,
        "<path": 81,
        "d=": 82,
        "instance-id=": 83,
        "semantic-id=": 84,
        "<ellipse": 85,
        "rx=": 86,
        "ry=": 87,
        "transform=": 88,
        "rotate": 89,
        "F": 90,
        "R": 91,
        "H": 92,
        "I": 93,
        "C": 94,
        "U": 95,
        "_": 96,
        "<text": 97,
        "font-family=\"Noto": 98,
        "S": 99,
        "J": 100,
        "K": 101,
        "font-size=": 102,
        "x=": 103,
        "y=": 104,
        "Y": 105,
        "</text>": 106,
        "W": 107,
        "X": 108,
        "</svg>": 109,
        "V": 110,
        "'": 111,
        "%": 112,
        "+": 113,
        "$": 114,
        "G": 115,
        "Z": 116,
        "300X7=": 117,
        "i=": 118,
        "q": 119,
        "*": 120,
        "j": 121,
        "\\": 122,
        "!": 123,
        "z": 124,
        "y": 125,
        "~": 126,
        "L=": 127,
        "@": 128,
        "300x11=": 129,
        "5=": 130,
        "H=": 131,
        "BXH=": 132,
        "[": 133,
        "]": 134,
        "=": 135,
        "h=": 136,
        "S=": 137,
        "HqHq=": 138,
        "R2=": 139,
        "R1=": 140,
        "11x250=": 141,
        "s=": 142,
        "300X10=": 143,
        "D=": 144,
        "300X2=": 145,
        "62=": 146,
        "block": 147,
        "260x3=": 148,
        "\u007f": 149,
        "100=": 150,
        "9=": 151,
        "6=": 152,
        "260X6=": 153,
        "300x7=": 154,
        "280X7=": 155,
        "B=": 156,
        "260X9=": 157,
        "280X10=": 158,
        "1=": 159,
        "260x4=": 160,
        "W=": 161,
        "R5=": 162,
        "R4=": 163,
        "I=": 164,
        "300x9=": 165,
        "300X5=": 166,
        "G=": 167,
        "|": 168,
        "R3=": 169,
        "250X2=": 170,
        "300x15=": 171,
        "260x8=": 172,
        "26=": 173,
        "260X5=": 174,
        "250X5=": 175,
        "260x11=": 176,
        "14X270=": 177,
        "260X7=": 178,
        "300X9=": 179,
        "62X6=": 180,
        "250X8=": 181,
        "8x260=": 182,
        "300x8=": 183,
        "260X8=": 184,
        "260x12=": 185,
        "300X8=": 186,
        "5x2=": 187,
        "X=": 188,
        "Y=": 189,
        "270X8=": 190,
        "7=": 191,
        "31=": 192,
        "40=": 193,
        "300X11=": 194,
        "^": 195,
        "81X2=": 196,
        "300x5=": 197
    },
    "id_to_token": {
        "1": "<",
        "2": "?",
        "3": "x",
        "4": "m",
        "5": "l",
        "6": " ",
        "7": "version=",
        "8": "\"",
        "9": "1",
        "10": ".",
        "11": "0",
        "12": "encoding=",
        "13": "u",
        "14": "t",
        "15": "f",
        "16": "-",
        "17": "8",
        "18": ">",
        "19": "\n",
        "20": "<svg",
        "21": "style=",
        "22": "b",
        "23": "a",
        "24": "c",
        "25": "k",
        "26": "g",
        "27": "r",
        "28": "o",
        "29": "n",
        "30": "d",
        "31": ":",
        "32": "#",
        "33": ";",
        "34": "viewBox=",
        "35": "xmlns=",
        "36": "h",
        "37": "p",
        "38": "/",
        "39": "w",
        "40": "3",
        "41": "2",
        "42": "s",
        "43": "v",
        "44": "xmlns:inkscape=",
        "45": "i",
        "46": "e",
        "47": "<g",
        "48": "id=",
        "49": "layer",
        "50": "A",
        "51": "D",
        "52": "N",
        "53": "O",
        "54": "T",
        "55": "E",
        "56": "B",
        "57": "L",
        "58": "P",
        "59": "inkscape:groupmode=",
        "60": "inkscape:label=",
        "61": "<circle",
        "62": "cx=",
        "63": "4",
        "64": "7",
        "65": "9",
        "66": "5",
        "67": "6",
        "68": "cy=",
        "69": "fill=",
        "70": "none",
        "71": "r=",
        "72": "stroke=",
        "73": "rgb",
        "74": "(",
        "75": ",",
        "76": ")",
        "77": "stroke-width=",
        "78": "</g>",
        "79": "Q",
        "80": "M",
        "81": "<path",
        "82": "d=",
        "83": "instance-id=",
        "84": "semantic-id=",
        "85": "<ellipse",
        "86": "rx=",
        "87": "ry=",
        "88": "transform=",
        "89": "rotate",
        "90": "F",
        "91": "R",
        "92": "H",
        "93": "I",
        "94": "C",
        "95": "U",
        "96": "_",
        "97": "<text",
        "98": "font-family=\"Noto",
        "99": "S",
        "100": "J",
        "101": "K",
        "102": "font-size=",
        "103": "x=",
        "104": "y=",
        "105": "Y",
        "106": "</text>",
        "107": "W",
        "108": "X",
        "109": "</svg>",
        "110": "V",
        "111": "'",
        "112": "%",
        "113": "+",
        "114": "$",
        "115": "G",
        "116": "Z",
        "117": "300X7=",
        "118": "i=",
        "119": "q",
        "120": "*",
        "121": "j",
        "122": "\\",
        "123": "!",
        "124": "z",
        "125": "y",
        "126": "~",
        "127": "L=",
        "128": "@",
        "129": "300x11=",
        "130": "5=",
        "131": "H=",
        "132": "BXH=",
        "133": "[",
        "134": "]",
        "135": "=",
        "136": "h=",
        "137": "S=",
        "138": "HqHq=",
        "139": "R2=",
        "140": "R1=",
        "141": "11x250=",
        "142": "s=",
        "143": "300X10=",
        "144": "D=",
        "145": "300X2=",
        "146": "62=",
        "147": "block",
        "148": "260x3=",
        "149": "\u007f",
        "150": "100=",
        "151": "9=",
        "152": "6=",
        "153": "260X6=",
        "154": "300x7=",
        "155": "280X7=",
        "156": "B=",
        "157": "260X9=",
        "158": "280X10=",
        "159": "1=",
        "160": "260x4=",
        "161": "W=",
        "162": "R5=",
        "163": "R4=",
        "164": "I=",
        "165": "300x9=",
        "166": "300X5=",
        "167": "G=",
        "168": "|",
        "169": "R3=",
        "170": "250X2=",
        "171": "300x15=",
        "172": "260x8=",
        "173": "26=",
        "174": "260X5=",
        "175": "250X5=",
        "176": "260x11=",
        "177": "14X270=",
        "178": "260X7=",
        "179": "300X9=",
        "180": "62X6=",
        "181": "250X8=",
        "182": "8x260=",
        "183": "300x8=",
        "184": "260X8=",
        "185": "260x12=",
        "186": "300X8=",
        "187": "5x2=",
        "188": "X=",
        "189": "Y=",
        "190": "270X8=",
        "191": "7=",
        "192": "31=",
        "193": "40=",
        "194": "300X11=",
        "195": "^",
        "196": "81X2=",
        "197": "300x5="
    },
    "ctr": 199,
    "end_token": 198,
    "max_seq_len": 3066723
}